### Step 1: Import packages and set the working directory

In [5]:
import os
import glob
import pandas as pd
import re
os.chdir("D:\quantium\quantium\data")

### Step 2: Use glob to match the pattern ‘csv’

In [6]:
extension = 'csv'
all_filenames = [i for i in glob.glob('*.{}'.format(extension))]

### Step 3: Combine all files in the list and export as CSV

In [7]:
#combine all files in the list
combined_csv = pd.concat([pd.read_csv(f) for f in all_filenames ])
#export to csv
combined_csv.to_csv( "combined_daily_sales_data.csv", index=False, encoding='utf-8-sig')

### Step 4: Remove any row which contains another type of product rather than 'pink morsel' from the product column

In [8]:
df = pd.read_csv("D:\quantium\quantium\data\combined_daily_sales_data.csv")

In [9]:
df.head()

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [10]:
# droping rows that contains another types of product
df = df.drop(df.index[df['product'].isin(['chartreuse morsel', 'gold morsel', 'lapis morsel', 'magenta morsel', 'periwinkle morsel', 'vermilion morsel'])])

In [11]:
df.value_counts('product')

product
pink morsel    5880
dtype: int64

In [12]:
# save modified csv file
df.to_csv('combined_daily_sales_data.csv')

### Step 5: Combined "quality" and "price" into a single field, "sales", by multiplying them together

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5880 entries, 0 to 41135
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   5880 non-null   object
 1   price     5880 non-null   object
 2   quantity  5880 non-null   int64
 3   date      5880 non-null   object
 4   region    5880 non-null   object
dtypes: int64(1), object(4)
memory usage: 275.6+ KB

In [16]:
df['price'] = df.price.str.replace(r'$', '')\
                   .str.replace(',', '.').astype(float)

D:\quantium\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  """Entry point for launching an IPython kernel.

In [17]:
df.head()

        product  price  quantity        date region
0   pink morsel    3.0       546  2018-02-06  north
1   pink morsel    3.0       549  2018-02-06  south
2   pink morsel    3.0       577  2018-02-06   east
3   pink morsel    3.0       519  2018-02-06   west
28  pink morsel    3.0       529  2018-02-07  north

In [19]:
# multiply the values and combine it into a single field, 'sales'
df['sales'] = df['price'] * df['quantity']

In [20]:
df.head()

        product  price  quantity        date region   sales
0   pink morsel    3.0       546  2018-02-06  north  1638.0
1   pink morsel    3.0       549  2018-02-06  south  1647.0
2   pink morsel    3.0       577  2018-02-06   east  1731.0
3   pink morsel    3.0       519  2018-02-06   west  1557.0
28  pink morsel    3.0       529  2018-02-07  north  1587.0

In [21]:
# save modified csv file
df.to_csv('combined_daily_sales_data.csv')